# HScale2D

## Description
Scales a 2D object.

```pascal
PROCEDURE HScale2D(
				h         : HANDLE;
				centerX   : REAL;
				centerY   : REAL;
				scaleX    : REAL;
				scaleY    : REAL;
				scaleText : BOOLEAN);
```

```python

def vs.HScale2D(h, centerX, centerY, scaleX, scaleY, scaleText):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|centerX|REAL||
|centerY|REAL||
|scaleX|REAL||
|scaleY|REAL||
|scaleText|BOOLEAN||

## Version
Availability: from Vectorworks 2014
## Category
* Object Editing